# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"

# Binaries
brew "antibody"
brew "coreutils" # Those that come with macOS are outdated
brew "git"
brew "httpie"
brew "mackup"
brew "mas" # Mac App Store manager
brew "trash" # Manage the Trash bin
brew "tree" # List directories in a tree structure

# Development
brew "composer"
brew "dnsmasq", restart_service: true
brew "imagemagick"
brew "mysql@5.7", restart_service: true
brew "nginx", restart_service: true
brew "node"
brew "php", link: false
brew "php@7.4", restart_service: true, link: true

# Fonts
cask "font-jetbrains-mono"

# Apps
cask "adobe-creative-cloud"
cask "airtable"
cask "alfred"
cask "brave-browser"
cask "firefox"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "iterm2"
cask "notion"
cask "tableplus"
cask "tinkerwell"
cask "visual-studio-code"

# Mac App Store
mas "Keynote", id: 409183694
mas "Microsoft Remote Desktop", id: 1295203466
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "The Unarchiver", id: 425424353
